
//
//数値などのデータを自由に出し入れできるのが、    ①    です。①は、使用する際に    ②    と名前 
//を記述し、宣言します。①から値を取り出すためには、事前に値を入れておかなければなりません。① 
//に値を入れる処理を    ③    といいます。また、①の宣言と同時に③することを、   ④    といいます。
//
//1. ①変数  ②型  ③代入  ④初期化 
//2. ①byte  ②short  ③int  ④long  ⑤double  ⑥float  ⑦基本型//
// 修正された文章
//数値などのデータを自由に出し入れできるのが、変数です。変数は、使用する際に変数名を記述し、
//宣言します。変数から値を取り出すためには、事前に値を代入しておかなければなりません。
//変数に値を入れる処理を代入といいます。また、変数の宣言と同時に代入することを、初期化といいます。
//
//2. 次の文の空欄を埋めてください。 
//整数を表すための主要な整数型として、    ①    、    ②    、    ③    、    ④    があります。ま 
//た、実数を表すための浮動小数点型には    ⑤    、    ⑥    があります。これらの型と文字型・論理型 
//の総称を    ⑦    といいます。 
３． ①true  ②false  ③false  ④true  ⑤true  ⑥true  ⑦true ⑧true
4./2,3,5
以下に示すのは、変数 i の値を 3 で割った剰余に応じて、「3 で割り切れます。」「3 で割った剰余は 1 で
す。」「3 で割った剰余は 2 です。」のいずれかを表示するプログラムです。①～⑦の空欄を埋めてプロ 
グラムを完成させてください。
i%3==0
i%3==2